brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
#include "web_server.h"
#include "config.h"
#include "../shared/protocol_defs.h"  // For CONFIG_MACHINE_INFO
#include "memory_utils.h"
#include "pico_uart.h"
#include "mqtt_client.h"
#include "brew_by_weight.h"
#include "scale/scale_manager.h"
#include "pairing_manager.h"
#include "cloud_connection.h"
#include "state/state_manager.h"
#include "power_meter/power_meter_manager.h"
#include "ui/ui.h"
#include "esp32_diagnostics.h"
#include "log_manager.h"
#include <ArduinoJson.h>
#include <stdarg.h>

// External reference to machine state defined in main.cpp
// Use getter function for thread-safe access to machine state
#include "runtime_state.h"

// External references to global managers
extern ScaleManager* scaleManager;
extern BrewByWeight* brewByWeight;
extern PowerMeterManager* powerMeterManager;

/**
 * Helper function to allocate memory for JSON buffers.
 * Tries PSRAM first (preferred for JSON), falls back to malloc.
 * Returns nullptr on failure.
 */
static char* allocateJsonBuffer(size_t size) {
    char* buffer = (char*)heap_caps_malloc(size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!buffer) {
        buffer = (char*)malloc(size);
    }
    return buffer;
}

// WebSocket event handler for AsyncWebSocket (ESP32Async library)
void BrewWebServer::handleWsEvent(AsyncWebSocket* server, AsyncWebSocketClient* client, AwsEventType type, void* arg, uint8_t* data, size_t len) {
    switch (type) {
        case WS_EVT_DISCONNECT:
            handleWsDisconnect(server, client);
            break;
            
        case WS_EVT_CONNECT:
            handleWsConnect(server, client);
            break;
            
        case WS_EVT_DATA:
            {
                AwsFrameInfo* info = (AwsFrameInfo*)arg;
                if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT) {
                    // Complete text message
                    handleWsMessage(client->id(), data, len);
                }
            }
            break;
            
        case WS_EVT_PONG:
            // Response to our ping
            break;
            
        case WS_EVT_ERROR:
            handleWsError(client, data, len);
            break;
    }
}

void BrewWebServer::handleWsConnect(AsyncWebSocket* server, AsyncWebSocketClient* client) {
    // Limit concurrent clients to save RAM (each WS client uses ~4KB)
    // Allow 2-3 clients to handle page refreshes where old connection overlaps with new one
    // Note: count() includes the connecting client, so > 3 means there are already 3+ clients
    if (server->count() > 3) {
        LOG_W("Too many WebSocket clients (%u), rejecting new client %u from %s", 
              server->count(), client->id(), client->remoteIP().toString().c_str());
        // Close gracefully - this will trigger WS_EVT_DISCONNECT, not WS_EVT_ERROR
        client->close();
        return;
    }
    
    LOG_I("WebSocket client %u connected from %s", client->id(), client->remoteIP().toString().c_str());
    
    // Note: Local and cloud WebSocket connections can work simultaneously
    // Cloud connection is no longer paused when local clients connect
    
    // Check if we have enough memory to send device info and status (needs ~3KB for JSON)
    size_t freeHeap = ESP.getFreeHeap();
    if (freeHeap > 10000) {
        // Always try to send device info and status on connect
        // Use a small delay to ensure client is fully ready, then send
        // This ensures the client receives initial state and doesn't mark connection as stale
        static unsigned long lastConnectTime = 0;
        lastConnectTime = millis();
        
        // Try immediate send if client is ready
        if (client->canSend()) {
            // TEST: Send a simple text message first to verify WebSocket is working
            const char* testMsg = "{\"type\":\"test\",\"message\":\"WebSocket connection test\"}";
            client->text(testMsg);
            LOG_I("Sent test message to client %u on connect", client->id());
            
            // Defensive: Defer broadcasts slightly to avoid crashes from race conditions
            // The client will receive status from the regular 2s keepalive cycle anyway
            // This prevents crashes when client connects during system initialization
            LOG_I("Client %u connected - status will be sent via keepalive cycle", client->id());
            
            // Note: We skip immediate broadcastDeviceInfo() and broadcastFullStatus() here
            // to avoid crashes. The regular keepalive cycle (every 2s) will send status
            // within 2 seconds, which is acceptable for initial connection.
        } else {
            // Client not ready yet - schedule a retry after a short delay
            // This ensures we send initial state even if client isn't immediately ready
            LOG_D("Client %u not ready for initial broadcast, will retry in 100ms", client->id());
            // Note: We'll retry in the next broadcastFullStatus call (happens every 500ms)
            // The client should receive status within 500ms, well before the 3s stale threshold
        }
    } else {
        LOG_W("Low memory (%zu bytes), deferring device info broadcast", freeHeap);
        // Client will request full state later when memory is available
    }
}

void BrewWebServer::handleWsDisconnect(AsyncWebSocket* server, AsyncWebSocketClient* client) {
    LOG_I("WebSocket client %u disconnected", client->id());
    // Note: Cloud connection continues to work independently of local WebSocket clients
    // No need to pause/resume cloud when local clients connect/disconnect
}

void BrewWebServer::handleWsError(AsyncWebSocketClient* client, uint8_t* data, size_t len) {
    // Log error with available details
    // Note: 'data' may contain error information, 'len' is the length
    if (data && len > 0) {
        LOG_E("WebSocket error on client %u from %s: %.*s", 
              client->id(), 
              client->remoteIP().toString().c_str(),
              (int)len, (char*)data);
    } else {
        LOG_E("WebSocket error on client %u from %s (no error details)", 
              client->id(), 
              client->remoteIP().toString().c_str());
    }
    // Close the connection on error to free resources
    client->close();
}

void BrewWebServer::handleWsMessage(uint32_t clientNum, uint8_t* payload, size_t length) {
    // Note: Local and cloud WebSocket connections work simultaneously
    // Cloud connection is no longer paused on local client activity
    
    // Parse JSON command from client - use stack allocation
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    StaticJsonDocument<1024> doc;
    #pragma GCC diagnostic pop
    DeserializationError error = deserializeJson(doc, payload, length);
    
    if (error) {
        LOG_W("Invalid WebSocket message from client %u", clientNum);
        return;
    }
    
