brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
        // Convert to Pico format: [enabled:1][eco_brew_temp:2][timeout_minutes:2]
        uint8_t payload[5];
        payload[0] = enabled ? 1 : 0;
        int16_t tempScaled = (int16_t)(brewTemp * 10);  // Convert to Celsius * 10
        payload[1] = (tempScaled >> 8) & 0xFF;
        payload[2] = tempScaled & 0xFF;
        payload[3] = (timeout >> 8) & 0xFF;
        payload[4] = timeout & 0xFF;
        
        if (_picoUart.sendCommand(MSG_CMD_SET_ECO, payload, 5)) {
            broadcastLogLevel("info", "Eco mode config saved: temp=%.1f°C, timeout=%dmin", 
                     brewTemp, timeout);
            // Broadcast updated device info so UI refreshes
            broadcastDeviceInfo();
        } else {
            broadcastLogLevel("error", "Failed to send eco config to device (saved locally as backup)");
        }
    }
    else if (cmd == "enter_eco") {
        // Manually enter eco mode
        uint8_t payload[1] = {1};  // 1 = enter eco
        if (_picoUart.sendCommand(MSG_CMD_SET_ECO, payload, 1)) {
            broadcastLogLevel("info", "Entering eco mode");
        } else {
            broadcastLogLevel("error", "Failed to enter eco mode");
        }
    }
    else if (cmd == "exit_eco") {
        // Manually exit eco mode (wake up)
        uint8_t payload[1] = {0};  // 0 = exit eco
        if (_picoUart.sendCommand(MSG_CMD_SET_ECO, payload, 1)) {
            broadcastLogLevel("info", "Exiting eco mode");
        } else {
            broadcastLogLevel("error", "Failed to exit eco mode");
        }
    }
    else if (cmd == "set_temp") {
        // Set temperature setpoint
        // Pico is the source of truth, but we persist on ESP32 as backup/cache
        String boiler = doc["boiler"] | "brew";
        float temp = doc["temp"] | 0.0f;
        
        // Validate temperature range
        if (temp < 50.0f || temp > 150.0f) {
            broadcastLogLevel("error", "Invalid temperature: %.1f°C (range: 50-150°C)", temp);
            return;
        }
        
        // Update runtime state immediately so status broadcasts show the new value
        ui_state_t& state = runtimeState().beginUpdate();
        if (boiler == "steam") {
            state.steam_setpoint = temp;
        } else {
            state.brew_setpoint = temp;
        }
        runtimeState().endUpdate();
        
        // Also persist in settings (backup/cache even if Pico is source of truth)
        auto& tempSettings = State.settings().temperature;
        if (boiler == "steam") {
            tempSettings.steamSetpoint = temp;
        } else {
            tempSettings.brewSetpoint = temp;
        }
        State.saveTemperatureSettings();  // Persist as backup
        
        // Pico expects: [target:1][temperature:int16] where temperature is Celsius * 10
        // Note: Pico (RP2350) is little-endian, so send LSB first
        uint8_t payload[3];
        payload[0] = (boiler == "steam") ? 0x01 : 0x00;  // 0=brew, 1=steam
        int16_t tempScaled = (int16_t)(temp * 10.0f);  // Convert to 0.1°C units
        payload[1] = tempScaled & 0xFF;         // LSB first (little-endian)
        payload[2] = (tempScaled >> 8) & 0xFF;  // MSB second
        if (_picoUart.sendCommand(MSG_CMD_SET_TEMP, payload, 3)) {
            // Pre-format message to avoid String.c_str() issues
            char tempMsg[64];
            snprintf(tempMsg, sizeof(tempMsg), "%s temp saved: %.1f°C", boiler.c_str(), temp);
            broadcastLog(tempMsg);
            // Broadcast updated device info so UI refreshes
            broadcastDeviceInfo();
        } else {
            broadcastLogLevel("error", "Failed to send temp to Pico (saved locally as backup)");
        }
    }
}

void BrewWebServer::handleModeCommand(JsonDocument& doc, const String& cmd) {
    // Set machine mode
    String mode = doc["mode"] | "";
    uint8_t modeCmd = 0;
    
    // Check for optional heating strategy parameter
    if (!doc["strategy"].isNull() && mode == "on") {
        uint8_t strategy = doc["strategy"].as<uint8_t>();
        if (strategy <= 3) {  // Valid strategy range: 0-3
            // Set heating strategy first
            uint8_t strategyPayload[2] = {0x01, strategy};  // CONFIG_HEATING_STRATEGY = 0x01
            _picoUart.sendCommand(MSG_CMD_CONFIG, strategyPayload, 2);
            broadcastLog("Heating strategy set to: %d", strategy);
        }
    }
    
    if (mode == "on" || mode == "ready" || mode == "brew") {
        // Validate machine state before allowing turn on
        // Only allow turning on from IDLE, READY, or ECO states
        uint8_t currentState = runtimeState().get().machine_state;
        if (currentState != UI_STATE_IDLE && 
            currentState != UI_STATE_READY && 
            currentState != UI_STATE_ECO) {
            const char* stateNames[] = {"INIT", "IDLE", "HEATING", "READY", "BREWING", "FAULT", "SAFE", "ECO"};
            char errorMsg[128];
            snprintf(errorMsg, sizeof(errorMsg), 
                "Cannot turn on machine: current state is %s. Machine must be in IDLE, READY, or ECO state.",
                (currentState < 8) ? stateNames[currentState] : "UNKNOWN");
            broadcastLogLevel("error", errorMsg);
            return;
        }
        modeCmd = 0x01;  // MODE_BREW
    } else if (mode == "steam") {
        modeCmd = 0x02;  // MODE_STEAM
    } else if (mode == "off" || mode == "standby" || mode == "idle") {
        modeCmd = 0x00;  // MODE_IDLE
    } else if (mode == "eco") {
        // Enter eco mode - also validate state
        uint8_t currentState = runtimeState().get().machine_state;
        if (currentState != UI_STATE_IDLE && 
            currentState != UI_STATE_READY && 
            currentState != UI_STATE_ECO) {
            const char* stateNames[] = {"INIT", "IDLE", "HEATING", "READY", "BREWING", "FAULT", "SAFE", "ECO"};
            char errorMsg[128];
            snprintf(errorMsg, sizeof(errorMsg), 
                "Cannot enter eco mode: current state is %s. Machine must be in IDLE, READY, or ECO state.",
                (currentState < 8) ? stateNames[currentState] : "UNKNOWN");
            broadcastLogLevel("error", errorMsg);
            return;
        }
        uint8_t ecoPayload[1] = {1};
        _picoUart.sendCommand(MSG_CMD_SET_ECO, ecoPayload, 1);
        return;
    }
    
    if (_picoUart.sendCommand(MSG_CMD_MODE, &modeCmd, 1)) {
        // Pre-format message to avoid String.c_str() issues
        char modeMsg[64];
        snprintf(modeMsg, sizeof(modeMsg), "Mode set to: %s", mode.c_str());
        broadcastLog(modeMsg);
        
        // If setting to standby/idle, immediately force state to IDLE
        // This prevents the machine from staying in cooldown state
        // The state will be updated from Pico status packets, but this ensures
        // immediate response to the user command
        if (modeCmd == 0x00) {  // MODE_IDLE
            // Force state to IDLE immediately - will be confirmed by next status packet
            ui_state_t& state = runtimeState().beginUpdate();
            state.machine_state = UI_STATE_IDLE;
            state.is_heating = false;
            runtimeState().endUpdate();
        }
    }
}

void BrewWebServer::handleMqttCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "mqtt_test") {
        // Test MQTT connection with temporary config (doesn't modify permanent config)
        MQTTConfig testConfig;
        
        // Start with current config as base
        MQTTConfig currentConfig = _mqttClient.getConfig();
        testConfig = currentConfig;
        
        // Apply test values from command if provided
        if (!doc["broker"].isNull()) strncpy(testConfig.broker, doc["broker"].as<const char*>(), sizeof(testConfig.broker) - 1);
        if (!doc["port"].isNull()) testConfig.port = doc["port"].as<uint16_t>();
        if (!doc["username"].isNull()) strncpy(testConfig.username, doc["username"].as<const char*>(), sizeof(testConfig.username) - 1);
        if (!doc["password"].isNull()) strncpy(testConfig.password, doc["password"].as<const char*>(), sizeof(testConfig.password) - 1);
        
        // Run test (doesn't modify permanent config)
        int result = _mqttClient.testConnectionWithConfig(testConfig);
        
        // Send structured response to UI
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
        StaticJsonDocument<256> response;
        #pragma GCC diagnostic pop
        response["type"] = "mqtt_test_result";
        response["success"] = (result == 0);
        
        switch (result) {
            case 0:
                response["message"] = "Connection successful";
                broadcastLogLevel("info", "MQTT test: Connection successful");
                break;
            case 1:
                response["message"] = "Broker address is empty";
                response["error"] = "broker_empty";
                broadcastLogLevel("error", "MQTT test: Broker address is empty");
                break;
            case 2:
                response["message"] = "WiFi not connected";
                response["error"] = "wifi_disconnected";
                broadcastLogLevel("error", "MQTT test: WiFi not connected");
                break;
            case 3:
                response["message"] = "Connection failed - check broker address and credentials";
                response["error"] = "connection_failed";
                broadcastLogLevel("error", "MQTT test: Connection failed");
                break;
            default:
                response["message"] = "Unknown error";
                response["error"] = "unknown";
                break;
        }
        
