brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
void BrewWebServer::handlePowerMeterCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "configure_power_meter") {
        String source = doc["source"] | "none";
        
        if (source == "none") {
            powerMeterManager->setSource(PowerMeterSource::NONE);
            _mqttClient.setPowerMeterTopic("");  // Unsubscribe from power meter topic
            broadcastLogLevel("info", "Power metering disabled");
        }
        // "hardware" source removed (v2.32 - hardware power metering eliminated from PCB)
        else if (source == "mqtt") {
            String topic = doc["topic"] | "";
            String format = doc["format"] | "auto";
            
            if (topic.length() > 0) {
                if (powerMeterManager && powerMeterManager->configureMqtt(topic.c_str(), format.c_str())) {
                    // Subscribe to the power meter topic so messages are forwarded (Tasmota/Shelly SENSOR)
                    _mqttClient.setPowerMeterTopic(topic.c_str());
                    // Pre-format message to avoid String.c_str() issues
                    char mqttMsg[64];
                    snprintf(mqttMsg, sizeof(mqttMsg), "MQTT power meter configured: %s", topic.c_str());
                    broadcastLog(mqttMsg);
                } else {
                    broadcastLogLevel("error", "Failed to configure MQTT power meter");
                }
            } else {
                broadcastLogLevel("error", "MQTT topic required");
            }
        }
        
        // Broadcast updated status
        broadcastPowerMeterStatus();
    }
    // "start_power_meter_discovery" command removed (v2.32 - hardware power metering removed)
    else if (cmd == "test_power_meter") {
        // Non-blocking MQTT power meter test:
        //   1. Check MQTT broker is connected
        //   2. Check topic is provided
        //   3. Subscribe to topic and configure meter
        //   4. Check if data is already available (from previous subscription)
        //   5. Return immediately - periodic power_meter_status broadcasts (every 5s)
        //      will update the UI once data starts flowing
        //
        // IMPORTANT: Must NOT block - websocket handlers run on the async web server
        // task. Blocking here causes RTOS watchdog reset and device crash.
        String topic = doc["topic"] | "";
        String format = doc["format"] | "auto";

        // Use heap-allocated JsonDocument to avoid stack overflow
        JsonDocument response;
        response["type"] = "power_meter_test_result";
        JsonArray steps = response["steps"].to<JsonArray>();

        // Step 1: MQTT connected?
        bool mqttOk = _mqttClient.isConnected();
        {
            JsonObject step = steps.add<JsonObject>();
            step["name"] = "MQTT Broker";
            step["ok"] = mqttOk;
            step["detail"] = mqttOk ? "Connected" : "Not connected - check Network > MQTT settings";
        }

        if (!mqttOk) {
            response["success"] = false;
            response["message"] = "MQTT broker not connected";
            char buf[256];
            serializeJson(response, buf);
            broadcastRaw(buf);
            return;
        }

        // Step 2: Topic configured?
        bool topicOk = topic.length() > 0;
        {
            JsonObject step = steps.add<JsonObject>();
            step["name"] = "Topic";
            step["ok"] = topicOk;
            step["detail"] = topicOk ? topic.c_str() : "No topic provided";
        }

        if (!topicOk) {
            response["success"] = false;
            response["message"] = "MQTT topic is empty";
            char buf[256];
            serializeJson(response, buf);
            broadcastRaw(buf);
            return;
        }

        // Step 3: Subscribe to topic and configure meter (non-blocking)
        _mqttClient.setPowerMeterTopic(topic.c_str());
        if (powerMeterManager) {
            powerMeterManager->configureMqtt(topic.c_str(), format.c_str());
        }
        {
            JsonObject step = steps.add<JsonObject>();
            step["name"] = "Subscribed";
            step["ok"] = true;
            step["detail"] = "Listening on topic";
        }

        // Step 4: Check if data is already available (instant check, no waiting)
        bool gotData = powerMeterManager && powerMeterManager->isConnected();
        {
            JsonObject step = steps.add<JsonObject>();
            step["name"] = "Data Received";
            step["ok"] = gotData;
            if (gotData) {
                PowerMeterReading reading;
                if (powerMeterManager->getReading(reading)) {
                    char detail[96];
                    snprintf(detail, sizeof(detail),
                             "Power: %.0fW, Voltage: %.1fV, Current: %.2fA",
                             reading.power, reading.voltage, reading.current);
                    step["detail"] = detail;
                } else {
                    step["detail"] = "Connected but no reading yet";
                }
            } else {
                step["detail"] = "Waiting for first message - status will update automatically";
            }
        }

        response["success"] = gotData;
        response["message"] = gotData
            ? "Power meter test passed - receiving data"
            : "Subscribed to topic - waiting for data (check status above)";

        char buf[512];
        serializeJson(response, buf);
        broadcastRaw(buf);

        // Also broadcast the current power meter status so the UI updates
        broadcastPowerMeterStatus();
    }
}

void BrewWebServer::handleWiFiCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "wifi_forget") {
        _wifiManager.clearCredentials();
        broadcastLogLevel("warn", "WiFi credentials cleared. Device will restart.");
        delay(1000);
        ESP.restart();
    }
    else if (cmd == "wifi_config") {
        // Static IP configuration
        bool staticIp = doc["staticIp"] | false;
        String ip = doc["ip"] | "";
        String gateway = doc["gateway"] | "";
        String subnet = doc["subnet"] | "255.255.255.0";
        String dns1 = doc["dns1"] | "";
        String dns2 = doc["dns2"] | "";
        
