brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
        _wifiManager.setStaticIP(staticIp, ip, gateway, subnet, dns1, dns2);
        
        if (staticIp) {
            // Pre-format message to avoid String.c_str() issues
            char ipMsg[64];
            snprintf(ipMsg, sizeof(ipMsg), "Static IP configured: %s. Reconnecting...", ip.c_str());
            broadcastLog(ipMsg);
        } else {
            broadcastLogLevel("info", "DHCP mode enabled. Reconnecting...");
        }
        
        // Reconnect to apply new settings
        delay(500);
        _wifiManager.connectToWiFi();
    }
}

void BrewWebServer::handleSystemCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "restart") {
        broadcastLogLevel("warn", "Device restarting...");
        delay(500);
        ESP.restart();
    }
    else if (cmd == "factory_reset") {
        broadcastLogLevel("warn", "Factory reset initiated...");
        State.factoryReset();
        _wifiManager.clearCredentials();
        delay(1000);
        ESP.restart();
    }
}

void BrewWebServer::handleOtaCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "check_update") {
        // Check for OTA updates from GitHub releases
        checkForUpdates();
    }
    else if (cmd == "ota_start") {
        // Update BrewOS firmware (combined: Pico first, then ESP32)
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startCombinedOTA(version);
        }
    }
    else if (cmd == "esp32_ota_start") {
        // ESP32 only - for recovery/advanced use
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startGitHubOTA(version);
        }
    }
    else if (cmd == "pico_ota_start") {
        // Pico only - for recovery/advanced use
        String version = doc["version"] | "";
        if (version.isEmpty()) {
            broadcastLogLevel("error", "OTA error: No version specified");
        } else {
            startPicoGitHubOTA(version);
        }
    }
    else if (cmd == "check_version_mismatch") {
        // Check and report firmware version mismatch
        checkVersionMismatch();
    }
}

void BrewWebServer::handleMachineInfoCommand(JsonDocument& doc, const String& cmd) {
    auto& machineInfo = State.settings().machineInfo;
    auto& networkSettings = State.settings().network;
    
    if (!doc["name"].isNull()) {
        strncpy(machineInfo.deviceName, doc["name"].as<const char*>(), sizeof(machineInfo.deviceName) - 1);
        machineInfo.deviceName[sizeof(machineInfo.deviceName) - 1] = '\0';
        // Also update hostname for mDNS
        strncpy(networkSettings.hostname, doc["name"].as<const char*>(), sizeof(networkSettings.hostname) - 1);
        networkSettings.hostname[sizeof(networkSettings.hostname) - 1] = '\0';
    }
    // Accept both "brand" and "machineBrand" field names for compatibility
    const char* brandValue = nullptr;
    if (!doc["brand"].isNull()) {
        brandValue = doc["brand"].as<const char*>();
    } else if (!doc["machineBrand"].isNull()) {
        brandValue = doc["machineBrand"].as<const char*>();
    }
    if (brandValue) {
        strncpy(machineInfo.machineBrand, brandValue, sizeof(machineInfo.machineBrand) - 1);
        machineInfo.machineBrand[sizeof(machineInfo.machineBrand) - 1] = '\0';
    }
    // Accept both "model" and "machineModel" field names for compatibility
    const char* modelValue = nullptr;
    if (!doc["model"].isNull()) {
        modelValue = doc["model"].as<const char*>();
    } else if (!doc["machineModel"].isNull()) {
        modelValue = doc["machineModel"].as<const char*>();
    }
    if (modelValue) {
        strncpy(machineInfo.machineModel, modelValue, sizeof(machineInfo.machineModel) - 1);
        machineInfo.machineModel[sizeof(machineInfo.machineModel) - 1] = '\0';
    }
    if (!doc["machineType"].isNull()) {
        const char* machineTypeStr = doc["machineType"].as<const char*>();
        strncpy(machineInfo.machineType, machineTypeStr, sizeof(machineInfo.machineType) - 1);
        machineInfo.machineType[sizeof(machineInfo.machineType) - 1] = '\0';
        
        // Also set the numeric machine type (used by State.getMachineType())
        // This allows manual setting when Pico doesn't send MSG_BOOT
        uint8_t numericType = 0; // 0 = unknown
        if (strcmp(machineTypeStr, "dual_boiler") == 0) {
            numericType = 1;
        } else if (strcmp(machineTypeStr, "single_boiler") == 0) {
            numericType = 2;
        } else if (strcmp(machineTypeStr, "heat_exchanger") == 0) {
            numericType = 3;
        } else if (strcmp(machineTypeStr, "thermoblock") == 0) {
            numericType = 4;
        }
        
        if (numericType != 0) {
            State.setMachineType(numericType, true);  // force=true to override Pico's value
            LOG_I("Machine type set from UI: %s (%d)", machineTypeStr, numericType);
        } else {
            LOG_W("Unknown machine type string: %s", machineTypeStr);
        }
    }
    
    State.saveMachineInfoSettings();
    
    // Send machine brand/model to Pico (source of truth)
    if (brandValue || modelValue) {
        // Get current values (in case only one was updated)
        char currentBrand[32];
        char currentModel[32];
        strncpy(currentBrand, machineInfo.machineBrand, sizeof(currentBrand) - 1);
        currentBrand[sizeof(currentBrand) - 1] = '\0';
        strncpy(currentModel, machineInfo.machineModel, sizeof(currentModel) - 1);
        currentModel[sizeof(currentModel) - 1] = '\0';
        
        // Prepare payload for CONFIG_MACHINE_INFO
        // Payload: 1 byte config_type + 31 bytes data (15+16 for brand+model)
        // Total: 32 bytes (within PROTOCOL_MAX_PAYLOAD limit)
        uint8_t payload[32];
        payload[0] = CONFIG_MACHINE_INFO;  // Machine brand and model
        memset(&payload[1], 0, 31);  // Zero out string fields
        strncpy((char*)&payload[1], currentBrand, 14);  // Brand (max 14 chars, 15 bytes including null)
        strncpy((char*)&payload[16], currentModel, 15);  // Model (max 15 chars, 16 bytes including null)
        
        if (_picoUart.sendCommand(MSG_CMD_CONFIG, payload, sizeof(payload))) {
            LOG_I("Sent machine info to Pico: %s %s", currentBrand, currentModel);
        } else {
            LOG_W("Failed to send machine info to Pico");
        }
    }
    
    State.saveNetworkSettings();
    
    // Broadcast device info update
    broadcastDeviceInfo();
    broadcastLog("Device info updated: %s", machineInfo.deviceName);
}

