brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
void BrewWebServer::handlePreferencesCommand(JsonDocument& doc, const String& cmd) {
    auto& prefs = State.settings().preferences;
    
    if (!doc["firstDayOfWeek"].isNull()) {
        const char* dow = doc["firstDayOfWeek"];
        prefs.firstDayOfWeek = (strcmp(dow, "monday") == 0) ? 1 : 0;
    }
    if (!doc["use24HourTime"].isNull()) {
        prefs.use24HourTime = doc["use24HourTime"];
    }
    if (!doc["temperatureUnit"].isNull()) {
        const char* unit = doc["temperatureUnit"];
        prefs.temperatureUnit = (strcmp(unit, "fahrenheit") == 0) ? 1 : 0;
    }
    if (!doc["electricityPrice"].isNull()) {
        prefs.electricityPrice = doc["electricityPrice"].as<float>();
    }
    if (!doc["currency"].isNull()) {
        strncpy(prefs.currency, doc["currency"].as<const char*>(), sizeof(prefs.currency) - 1);
        prefs.currency[sizeof(prefs.currency) - 1] = '\0';
    }
    if (!doc["lastHeatingStrategy"].isNull()) {
        prefs.lastHeatingStrategy = doc["lastHeatingStrategy"];
    }
    
    // Mark as initialized once browser sends first preferences
    prefs.initialized = true;
    
    State.saveUserPreferences();
    broadcastDeviceInfo();
    broadcastLogLevel("info", "User preferences updated");
}

void BrewWebServer::handleTimeCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "set_time_config") {
        auto& timeSettings = State.settings().time;
        
        if (!doc["useNTP"].isNull()) timeSettings.useNTP = doc["useNTP"].as<bool>();
        if (!doc["ntpServer"].isNull()) {
            strncpy(
                timeSettings.ntpServer,
                doc["ntpServer"].as<const char*>(),
                sizeof(timeSettings.ntpServer) - 1
            );
        }
        if (!doc["utcOffsetMinutes"].isNull()) timeSettings.utcOffsetMinutes = doc["utcOffsetMinutes"].as<int16_t>();
        if (!doc["dstEnabled"].isNull()) timeSettings.dstEnabled = doc["dstEnabled"].as<bool>();
        if (!doc["dstOffsetMinutes"].isNull()) timeSettings.dstOffsetMinutes = doc["dstOffsetMinutes"].as<int16_t>();
        
        State.saveTimeSettings();
        
        // Apply new NTP settings
        _wifiManager.configureNTP(
            timeSettings.ntpServer,
            timeSettings.utcOffsetMinutes,
            timeSettings.dstEnabled,
            timeSettings.dstOffsetMinutes
        );
        
        broadcastDeviceInfo();
        broadcastLogLevel("info", "Time settings updated");
    }
    else if (cmd == "get_time_status") {
        // Get time status (for UI polling)
        TimeStatus ts = _wifiManager.getTimeStatus();
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
        StaticJsonDocument<512> tsDoc;
        #pragma GCC diagnostic pop
        tsDoc["type"] = "time_status";
        tsDoc["synced"] = ts.ntpSynced;
        tsDoc["currentTime"] = ts.currentTime;
        tsDoc["timezone"] = ts.timezone;
        tsDoc["utcOffset"] = ts.utcOffset;
        
        size_t jsonSize = measureJson(tsDoc) + 1;
        char* jsonBuffer = allocateJsonBuffer(jsonSize);
        if (jsonBuffer) {
            serializeJson(tsDoc, jsonBuffer, jsonSize);
            broadcastRaw(jsonBuffer);
            free(jsonBuffer);
        }
    }
    else if (cmd == "sync_time") {
        // Force NTP sync
        if (_wifiManager.isConnected()) {
            _wifiManager.syncNTP();
            broadcastLogLevel("info", "NTP sync initiated");
        } else {
            broadcastLogLevel("error", "Cannot sync time: WiFi not connected");
        }
    }
}

void BrewWebServer::handleMaintenanceCommand(JsonDocument& doc, const String& cmd) {
    String type = doc["type"] | "";
    if (!type.isEmpty()) {
        State.recordMaintenance(type.c_str());
        // Pre-format message to avoid String.c_str() issues
        char maintMsg[64];
        snprintf(maintMsg, sizeof(maintMsg), "Maintenance recorded: %s", type.c_str());
        broadcastLog(maintMsg);
    }
}

void BrewWebServer::handleDiagnosticsCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "run_diagnostics") {
        broadcastLogLevel("info", "Running hardware diagnostics...");
        
        // Run ESP32-side diagnostic tests first (WEIGHT_STOP_PIN and PICO_RUN_PIN)
        LOG_I("Starting ESP32-side diagnostic tests: WEIGHT_STOP=0x%02X, PICO_RUN=0x%02X", 
              DIAG_TEST_WEIGHT_STOP_OUTPUT, DIAG_TEST_PICO_RUN_OUTPUT);
        uint8_t esp32Tests[] = { DIAG_TEST_WEIGHT_STOP_OUTPUT, DIAG_TEST_PICO_RUN_OUTPUT };
        LOG_I("ESP32 tests array size: %zu", sizeof(esp32Tests) / sizeof(esp32Tests[0]));
        for (size_t i = 0; i < sizeof(esp32Tests) / sizeof(esp32Tests[0]); i++) {
            LOG_I("Running ESP32 test %zu: test_id=0x%02X (%d)", i, esp32Tests[i], esp32Tests[i]);
            diag_result_t result;
            uint8_t status = esp32_diagnostics_run_test(esp32Tests[i], &result, &_picoUart);
            
            LOG_I("ESP32 diagnostic test %d (0x%02X): status=%d, message=%s", 
                  result.test_id, result.test_id, result.status, result.message);
            
            // Broadcast result in same format as Pico results
            #pragma GCC diagnostic push
            #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
            StaticJsonDocument<384> resultDoc;
            #pragma GCC diagnostic pop
            resultDoc["type"] = "diagnostics_result";
            resultDoc["testId"] = result.test_id;
            resultDoc["status"] = result.status;
            resultDoc["rawValue"] = result.raw_value;
            resultDoc["expectedMin"] = 0;
            resultDoc["expectedMax"] = 0;
            resultDoc["message"] = result.message;
            
            String jsonStr;
            serializeJson(resultDoc, jsonStr);
            LOG_I("Broadcasting ESP32 diagnostic result: %s", jsonStr.c_str());
            broadcastRaw(jsonStr.c_str());
            
            delay(100);  // Delay to ensure WebSocket message is sent before next test
        }
        
        // Then send command to Pico to run all diagnostics
        uint8_t payload[1] = { 0x00 };  // DIAG_TEST_ALL
        if (_picoUart.sendCommand(MSG_CMD_DIAGNOSTICS, payload, 1)) {
            // Toggle WEIGHT_STOP for ~2s so Pico's WEIGHT_STOP input test (0x13) can see HIGH.
            // Pico runs tests after receiving the command; without this, it only sees LOW (idle).
            pinMode(WEIGHT_STOP_PIN, OUTPUT);
            for (int i = 0; i < 10; i++) {
                digitalWrite(WEIGHT_STOP_PIN, HIGH);
                delay(100);
                digitalWrite(WEIGHT_STOP_PIN, LOW);
                delay(100);
            }
            digitalWrite(WEIGHT_STOP_PIN, LOW);
            // Send immediate ping to help with ping-pong test
            _picoUart.sendPing();
        } else {
            broadcastLogLevel("error", "Failed to start diagnostics");
        }
    }
    else if (cmd == "run_diagnostic_test") {
        // Run a single diagnostic test
        uint8_t testId = doc["testId"] | 0;
        uint8_t payload[1] = { testId };
        if (_picoUart.sendCommand(MSG_CMD_DIAGNOSTICS, payload, 1)) {
            // Send immediate ping to help with ping-pong test (especially for ESP32 comm test)
            _picoUart.sendPing();
            broadcastLog("Running diagnostic test %d", testId);
        } else {
            broadcastLogLevel("error", "Failed to start diagnostic test");
        }
    }
}

void BrewWebServer::handleLogCommand(JsonDocument& doc, const String& cmd) {
    if (cmd == "set_log_config") {
        // Enable/disable log features
        if (!doc["enabled"].isNull()) {
            bool enabled = doc["enabled"].as<bool>();
            if (enabled) {
                g_logManager->enable();
            } else {
                g_logManager->disable();
            }
            State.settings().system.logBufferEnabled = enabled;
        }
        
        if (!doc["picoEnabled"].isNull()) {
            bool enabled = doc["picoEnabled"].as<bool>();
            if (g_logManager && g_logManager->isEnabled()) {
                g_logManager->setPicoLogForwarding(enabled, [this](uint8_t* payload, size_t len) {
                    return _picoUart.sendCommand(MSG_CMD_LOG_CONFIG, payload, len);
                });
            }
            State.settings().system.picoLogForwardingEnabled = enabled;
        }
        
