brewos-io/firmware/src/esp32/src/web_server_websocket.cpp
        if (!doc["debugEnabled"].isNull()) {
            bool enabled = doc["debugEnabled"].as<bool>();
            setLogLevel(enabled ? BREWOS_LOG_DEBUG : BREWOS_LOG_INFO);
            State.settings().system.debugLogsEnabled = enabled;
        }
        
        State.saveSystemSettings();
        broadcastLogLevel("info", "Log configuration updated");
        
        // Broadcast updated status
        JsonDocument statusDoc;
        statusDoc["type"] = "log_config";
        statusDoc["enabled"] = g_logManager && g_logManager->isEnabled();
        statusDoc["picoEnabled"] = g_logManager && g_logManager->isPicoLogForwardingEnabled();
        statusDoc["debugEnabled"] = State.settings().system.debugLogsEnabled;
        statusDoc["size"] = g_logManager ? g_logManager->getLogsSize() : 0;
        
        String jsonStr;
        serializeJson(statusDoc, jsonStr);
        broadcastRaw(jsonStr);
    }
    else if (cmd == "clear_logs") {
        if (g_logManager) {
            g_logManager->clear();
            broadcastLogLevel("info", "Logs cleared");
        }
    }
    else if (cmd == "get_log_config") {
        JsonDocument statusDoc;
        statusDoc["type"] = "log_config";
        statusDoc["enabled"] = g_logManager && g_logManager->isEnabled();
        statusDoc["picoEnabled"] = g_logManager && g_logManager->isPicoLogForwardingEnabled();
        statusDoc["debugEnabled"] = State.settings().system.debugLogsEnabled;
        statusDoc["size"] = g_logManager ? g_logManager->getLogsSize() : 0;
        
        String jsonStr;
        serializeJson(statusDoc, jsonStr);
        broadcastRaw(jsonStr);
    }
}
